app/controllers/home_controller.rb

SELECT * FROM "pics" WHERE (id <> 36) ORDER BY RANDOM() LIMIT 1
SELECT * FROM "pics" ORDER BY RANDOM() LIMIT 1
SELECT count(*) AS count_all FROM "pics" WHERE (wins > 0 or losses > 0)
---
  def index

    @l_pics = Pic.find(:all, :order => "RANDOM() LIMIT 1");
    l_id = @l_pics[0].id;
    @r_pics = Pic.find(:all, :conditions =>["id <> ?", l_id], :order => "RANDOM() LIMIT 1");

    @l_pic = @l_pics[0];
    @r_pic = @r_pics[0];

    # left pic 设置tag
    @l_pic.setTags(@l_pic.id)
    # right pic 设置tag
    @r_pic.setTags(@r_pic.id)

    # subject
    @subjectId = '0'

    #进度条获取
    @pickPercentage = Pic.count(:all, :conditions =>["wins > 0 or losses > 0"] );