app/controllers/picks_controller.rb

  def index
    @picks = Pick.all
---
SELECT * FROM "picks"

  def show
    pickId = params[:id]
    id = pickId.split('_')

    last_l_pic_id = params[:last_l_pic_id]
    last_r_pic_id = params[:last_r_pic_id]
    puts '======' + last_l_pic_id.to_s
    if last_l_pic_id
      @last_l_pic = Pic.find(last_l_pic_id)
    end
    if last_r_pic_id
      @last_r_pic = Pic.find(last_r_pic_id)
    end

    # left pic
    @l_pic = Pic.find(id[0])
    @l_pic.setTags(@l_pic.id)
    # right pic
    @r_pic = Pic.find(id[1])
    @r_pic.setTags(@r_pic.id)

    # subject
    @subjectId = id[2]==nil ? '0' : id[2]

    #进度条获取
    @pickPercentage = Pic.count(:all, :conditions =>["wins > 0 or losses > 0"] );
---
SELECT * FROM "pics" WHERE ("pics"."id" = 12)
SELECT count(*) AS count_all FROM "pics" WHERE (wins > 0 or losses > 0)

  def new
    @l_pics = Pic.find(:all, :order => "RANDOM() LIMIT 1");
---
SELECT * FROM "pics" WHERE (id <> 13) ORDER BY RANDOM() LIMIT 1

  def create
    @win_pic_id = params[:l_pic_id];
    @lose_pic_id = params[:r_pic_id];

    @pick = Pick.new
    @pick.user = 'mySelf'
    @pick.ip = request.remote_ip
    @pick.subject = params[:subjectId]
    #puts params[:subjectId]+'-------'

    @pick.win_pic_id = @win_pic_id
    @pick.loss_pic_id = @lose_pic_id

     pp = Pic.new
     pp.pk(@win_pic_id, @lose_pic_id)

     respond_to do |format|
       if @pick.save
---
INSERT INTO "picks" ("created_at", "loss_pic_id", "updated_at", "subject", "ip", "user", "win_pic_id") VALUES('2011-12-25 08:11:11', '28', '2011-12-25 08:11:11', '--- :subjectId