app/controllers/pick_subjects_controller.rb

SELECT * FROM "pics" WHERE (id <> 28) AND ("pics"."subject" = '1') ORDER BY RANDOM() LIMIT 1
---
  def show
    subjectId = params[:id]

    if(subjectId == '0')
      respond_to do |format|
          format.html { redirect_to :controller=> "picks", :action => "new",
                                    :last_l_pic_id => params[:last_l_pic_id], :last_r_pic_id => params[:last_r_pic_id] }
        end
    else

    @l_pics = Pic.find_all_by_subject(subjectId, :order => "RANDOM() LIMIT 1");