app/controllers/pics_controller.rb

  def index

    @pics = Hash.new
    Subject.all.each do |s,i|
      @pics[s] = (Pic.search(params[:page],s.id))
---
SELECT * FROM "subjects"
SELECT * FROM "pics" WHERE (subject = 1) ORDER BY scores desc LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "pics"

  def show
    @pic = Pic.find(params[:id])
---
SELECT * FROM "pics" WHERE ("pics"."id" = 1)

  def create

    @pic = Pic.new(params[:pic])

    ## keyname前缀
    ## TODO 抽出来
    @pic.keyname =  Time.now.to_i.to_s + "_"

    ## TODO 也抽
    @pic.scores = 100
    @pic.wins = 0
    @pic.losses = 0
    @pic.source = 'local'

    respond_to do |format|
      if @pic.save
---
INSERT INTO "pics" ("keyname", "created_at", "title", "image_url", "thumbnail_pic", "scores", "updated_at", "original_pic", "bmiddle_pic", "subject", "wins", "tmptags", "description", "source", "losses") VALUES('1329140699_', '2012-02-13 13:44:59', '111111', '01_login_big11.jpg', NULL, 100, '2012-02-13 13:44:59', NULL, NULL, '1', 0, '', '', 'local', 0)

          #tmp = tmp.gsub('，',' ')  #中文的逗号

          tmp.split.each do |n|
            tag = Tag.find_by_name(n)
---
SELECT * FROM "tags" WHERE ("tags"."name" = 'llll') LIMIT 1

              tag =Tag.new(
                :name => n
              )
              tag.save
---
INSERT INTO "pic_tags" ("created_at", "tag_id", "updated_at", "pic_id") VALUES('2011-12-22 17:30:16', 2, '2011-12-22 17:30:16', NULL)
INSERT INTO "tags" ("name", "created_at", "updated_at", "memo", "link") VALUES('llll', '2011-12-22 17:28:16', '2011-12-22 17:28:16', NULL, NULL)

              :pic_id => @pic.id,
              :tag_id => tag.id
            )
            picTag.save
---
UPDATE "pics" SET "updated_at" = '2012-02-13 13:19:16', "bmiddle_pic" = '/Users/fishforward/Documents/Aptana Studio 3 Workspace/pickpic/public/pic/original_pic/1/01_login_big11.jpg!big', "thumbnail_pic" = '/Users/fishforward/Documents/Aptana Studio 3 Workspace/pickpic/public/pic/original_pic/1/01_login_big11.jpg!middle', "keyname" = '1329139156_1.jpg' WHERE "id" = 1